// 005 값과 변수 이해하기

var name = 'Peter'
var number = 200
var isTrue = true;
var nothing = null;
var empty = undefined;
var list = [];
var ref = {};
var func = function () {};

/*
    선언 키워드 : 자바스크립트는 다른 컴파일 언어와 달리 값을 변수로 지정할 때 어떤 유형인지
    명시하지 않아도 된다. 그리고 일관된 var 키워드를 맨 앞에 작성하여 변수를 선언한다
    프로그래밍 할 때 값의 유형을 일일이 명시하지 않으면, 런타임 시 변수의 값에 의해 동적으로 유형이 결정된다.
    이를 동적 바인딩 이라고 한다

    변수명 : 변수를 선언할 때 선언 키워드 다음에 변수명을 작성한다. 어떤 변수명으로 할지 정하는 것은 개발자의 재량이지만, 반드시 피해야 할
    변수명이 있다. 그것은 바로 키워드이다. 자바스크립트 언어에서 이미 사용 중이거나 혹은 나중에
    사용할 계획이 있기 떄문에, 키워드를 변수명으로 선언한다면 에러가 발생한다.

    등호 : 등호를 사이ㅣ에 두고 왼쪽에 변수명과 오른쪽에 값을 작성한다. 변수명이 정의된 변수 메모리에 값을 대입한다는 의미이다.

    값 : 자바스크립트에서 변수에 넣을 수 있는 값은 다양하다. 간단하게 단일 자료형의 값부터 표현식, 함수 까지 값으로 대입할 수 있다.

    키워드의 종류는 찾아보길..
    


*/